{"class_name": "Model", "keras_version": "1.2.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 96, 1366], "input_dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"target_shape": [96, 1366, 1], "name": "reshape_1", "input_dtype": "float32", "batch_input_shape": [null, 96, 1366], "trainable": true}, "name": "reshape_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_1", "padding": [0, 37], "trainable": true}, "name": "zeropadding2d_1", "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "name": "bn_0_freq", "mode": 0, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}, "name": "bn_0_freq", "inbound_nodes": [[["zeropadding2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "name": "conv1", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "dim_ordering": "tf", "bias": true, "nb_col": 3, "b_constraint": null, "nb_filter": 32}, "name": "conv1", "inbound_nodes": [[["bn_0_freq", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "name": "bn1", "mode": 0, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}, "name": "bn1", "inbound_nodes": [[["conv1", 0, 0]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "name": "elu_1", "inbound_nodes": [[["bn1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "pool1", "border_mode": "valid"}, "name": "pool1", "inbound_nodes": [[["elu_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout1", "trainable": true}, "name": "dropout1", "inbound_nodes": [[["pool1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "name": "conv2", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "dim_ordering": "tf", "bias": true, "nb_col": 3, "b_constraint": null, "nb_filter": 64}, "name": "conv2", "inbound_nodes": [[["dropout1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "name": "bn2", "mode": 0, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}, "name": "bn2", "inbound_nodes": [[["conv2", 0, 0]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "name": "elu_2", "inbound_nodes": [[["bn2", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [3, 3], "pool_size": [3, 3], "dim_ordering": "tf", "trainable": true, "name": "pool2", "border_mode": "valid"}, "name": "pool2", "inbound_nodes": [[["elu_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout2", "trainable": true}, "name": "dropout2", "inbound_nodes": [[["pool2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "name": "conv3", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "dim_ordering": "tf", "bias": true, "nb_col": 3, "b_constraint": null, "nb_filter": 128}, "name": "conv3", "inbound_nodes": [[["dropout2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "name": "bn3", "mode": 0, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}, "name": "bn3", "inbound_nodes": [[["conv3", 0, 0]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "name": "elu_3", "inbound_nodes": [[["bn3", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "pool_size": [4, 4], "dim_ordering": "tf", "trainable": true, "name": "pool3", "border_mode": "valid"}, "name": "pool3", "inbound_nodes": [[["elu_3", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout3", "trainable": true}, "name": "dropout3", "inbound_nodes": [[["pool3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "name": "conv4", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "dim_ordering": "tf", "bias": true, "nb_col": 3, "b_constraint": null, "nb_filter": 128}, "name": "conv4", "inbound_nodes": [[["dropout3", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "name": "bn4", "mode": 0, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99}, "name": "bn4", "inbound_nodes": [[["conv4", 0, 0]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "name": "elu_4", "inbound_nodes": [[["bn4", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "pool_size": [4, 4], "dim_ordering": "tf", "trainable": true, "name": "pool4", "border_mode": "valid"}, "name": "pool4", "inbound_nodes": [[["elu_4", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout4", "trainable": true}, "name": "dropout4", "inbound_nodes": [[["pool4", 0, 0]]]}, {"class_name": "Reshape", "config": {"target_shape": [15, 128], "name": "reshape_2", "trainable": true}, "name": "reshape_2", "inbound_nodes": [[["dropout4", 0, 0]]]}, {"class_name": "GRU", "config": {"return_sequences": true, "inner_activation": "hard_sigmoid", "unroll": false, "init": "glorot_uniform", "input_length": null, "name": "gru1", "activation": "tanh", "stateful": false, "b_regularizer": null, "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "input_dim": 128, "consume_less": "cpu", "W_regularizer": null, "trainable": true, "output_dim": 32, "dropout_U": 0.0, "U_regularizer": null}, "name": "gru1", "inbound_nodes": [[["reshape_2", 0, 0]]]}, {"class_name": "GRU", "config": {"return_sequences": false, "inner_activation": "hard_sigmoid", "unroll": false, "init": "glorot_uniform", "input_length": null, "name": "gru2", "activation": "tanh", "stateful": false, "b_regularizer": null, "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "input_dim": 32, "consume_less": "cpu", "W_regularizer": null, "trainable": true, "output_dim": 32, "dropout_U": 0.0, "U_regularizer": null}, "name": "gru2", "inbound_nodes": [[["gru1", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_1", "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["gru2", 0, 0]]]}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "output", "activation": "sigmoid", "b_regularizer": null, "W_constraint": null, "input_dim": 32, "W_regularizer": null, "trainable": true, "output_dim": 40, "bias": true, "b_constraint": null}, "name": "output", "inbound_nodes": [[["dropout_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["output", 0, 0]]}}