{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 96, 1366], "name": "input_1", "input_dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "reshape_1", "config": {"batch_input_shape": [null, 96, 1366], "name": "reshape_1", "input_dtype": "float32", "target_shape": [96, 1366, 1], "trainable": true}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0]]], "name": "bn_0_freq", "config": {"name": "bn_0_freq", "mode": 0, "axis": 2, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn_0_freq", 0, 0]]], "name": "conv1", "config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "conv1", "border_mode": "same", "nb_filter": 32, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv1", 0, 0]]], "name": "bn1", "config": {"name": "bn1", "mode": 0, "axis": 3, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn1", 0, 0]]], "name": "elu_1", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_1", 0, 0]]], "name": "pool1", "config": {"name": "pool1", "pool_size": [2, 4], "dim_ordering": "tf", "strides": [2, 4], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool1", 0, 0]]], "name": "conv2", "config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "conv2", "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv2", 0, 0]]], "name": "bn2", "config": {"name": "bn2", "mode": 0, "axis": 3, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2", 0, 0]]], "name": "elu_2", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_2", 0, 0]]], "name": "pool2", "config": {"name": "pool2", "pool_size": [2, 4], "dim_ordering": "tf", "strides": [2, 4], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool2", 0, 0]]], "name": "conv3", "config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "conv3", "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv3", 0, 0]]], "name": "bn3", "config": {"name": "bn3", "mode": 0, "axis": 3, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3", 0, 0]]], "name": "elu_3", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_3", 0, 0]]], "name": "pool3", "config": {"name": "pool3", "pool_size": [2, 4], "dim_ordering": "tf", "strides": [2, 4], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool3", 0, 0]]], "name": "conv4", "config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "conv4", "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv4", 0, 0]]], "name": "bn4", "config": {"name": "bn4", "mode": 0, "axis": 3, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4", 0, 0]]], "name": "elu_4", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_4", 0, 0]]], "name": "pool4", "config": {"name": "pool4", "pool_size": [3, 5], "dim_ordering": "tf", "strides": [3, 5], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool4", 0, 0]]], "name": "conv5", "config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "conv5", "border_mode": "same", "nb_filter": 256, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv5", 0, 0]]], "name": "bn5", "config": {"name": "bn5", "mode": 0, "axis": 3, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn5", 0, 0]]], "name": "elu_5", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_5", 0, 0]]], "name": "pool5", "config": {"name": "pool5", "pool_size": [4, 4], "dim_ordering": "tf", "strides": [4, 4], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool5", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "output", "config": {"name": "output", "b_constraint": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "sigmoid", "input_dim": 256, "b_regularizer": null, "activity_regularizer": null, "output_dim": 40}, "class_name": "Dense"}], "output_layers": [["output", 0, 0]]}, "keras_version": "1.2.1", "class_name": "Model"}